class Translation(object):

    ERROR = "<b>ᴇʀʀᴏʀ :</b> {}"

    START_TEXT = """ʜᴇʏ {}, ɪ'ᴍ sᴛxᴜᴘʟᴏᴀᴅᴇʀ ᴛᴇʟᴇɢʀᴀᴍ ʙᴏᴛ!
    
ᴊᴜsᴛ sᴇɴᴅ ᴍᴇ ᴀɴʏ ᴅɪʀᴇᴄᴛ ᴅᴏᴡɴʟᴏᴀᴅ ʟɪɴᴋ ᴀɴᴅ ɪ'ʟʟ ᴜᴘʟᴏᴀᴅ ғɪʟᴇ ʀᴇᴍᴏᴛᴇʟʏ ᴛᴏ ᴛᴇʟᴇɢʀᴀᴍ.

ᴡᴀɴᴛ ᴛᴏ ᴋɴᴏᴡ ᴍᴏʀᴇ? sᴇɴᴅ /help ᴄᴏᴍᴍᴀɴᴅ ᴛᴏ ᴍᴇ!
    FORMAT_SELECTION = "ᴄʜᴏᴏsᴇ ʏᴏᴜʀ ᴘʀᴇғᴇʀʀᴇᴅ ғᴏʀᴍᴀᴛ: <a href='{}'>ᴘʟᴇᴀsᴇ ɴᴏᴛᴇ ᴛʜᴀᴛ ғɪʟᴇ sɪᴢᴇs ᴀʀᴇ ᴀᴘᴘʀᴏxɪᴍᴀᴛᴇ.</a> \n\nғᴏʀ ᴄᴜsᴛᴏᴍ ᴛʜᴜᴍʙɴᴀɪʟ's, sᴇɴᴅ ᴀ ᴘʜᴏᴛᴏ ʙᴇғᴏʀᴇ ᴏʀ sᴏᴏɴ ᴀғᴛᴇʀ ᴛᴀᴘᴘɪɴɢ ᴀɴʏ ᴏғ ᴛʜᴇ ʙᴜᴛᴛᴏɴs ʙᴇʟᴏᴡ.\n\nᴛᴏ ʀᴇᴍᴏᴠᴇ ᴛʜᴇ ᴀᴜᴛᴏ-ɢᴇɴᴇʀᴀᴛᴇᴅ ᴛʜᴜᴍʙɴᴀɪʟ, ᴇᴍᴘʟᴏʏ ᴛʜᴇ ᴄᴏᴍᴍᴀɴᴅ /deletethumbnail."
    SET_CUSTOM_USERNAME_PASSWORD = """ғᴏʀ ᴘʀᴇᴍɪᴜᴍ ᴠɪᴅᴇᴏ ᴅᴏᴡɴʟᴏᴀᴅs, ᴘʟᴇᴀsᴇ sᴜᴘᴘʟʏ ᴛʜᴇ ɪɴғᴏʀᴍᴀᴛɪᴏɴ ɪɴ ᴛʜᴇ ғᴏʀᴍᴀᴛ ʙᴇʟᴏᴡ.
    
    ᴜʀʟ | ғɪʟᴇɴᴀᴍᴇ | ᴜsᴇʀɴᴀᴍᴇ | ᴘᴀssᴡᴏʀᴅ."""
    DOWNLOAD_START = "ᴅᴏᴡɴʟᴏᴀᴅɪɴɢ! 📥"
    UPLOAD_START = "ᴜᴘʟᴏᴀᴅɪɴɢ! 📤"
    RCHD_TG_API_LIMIT = "ᴅᴏᴡɴʟᴏᴀᴅᴇᴅ ɪɴ {} sᴇᴄᴏɴᴅs.\n\nғɪʟᴇ sɪᴢᴇ ᴅᴇᴛᴇᴄᴛᴇᴅ: {}\nsᴏʀʀʏ, ɪ ᴄᴀɴ'ᴛ ᴜᴘʟᴏᴀᴅ ғɪʟᴇs ʟᴀʀɢᴇʀ ᴛʜᴀɴ 2ɢʙ ᴀs ᴘᴇʀ ᴛʜᴇ ᴛᴇʟᴇɢʀᴀᴍ ᴀᴘɪ ʀᴇsᴛʀɪᴄᴛɪᴏɴs."
    AFTER_SUCCESSFUL_UPLOAD_MSG = "ᴀᴘᴘʀᴇᴄɪᴀᴛᴇ ʏᴏᴜʀ ᴜsᴀɢᴇ ᴏғ ᴛʜᴇ ʙᴏᴛ.\n\n<ʙ>ғᴇᴇʟ ғʀᴇᴇ ᴛᴏ ᴊᴏɪɴ ᴜs ᴀᴛ: @SABBiRTUNE</ʙ>"
    AFTER_SUCCESSFUL_UPLOAD_MSG_WITH_TS = "ᴅᴏᴡɴʟᴏᴀᴅᴇᴅ ɪɴ {} sᴇᴄᴏɴᴅs & ᴜᴘʟᴏᴀᴅᴇᴅ ɪɴ {} sᴇᴄᴏɴᴅs.\n\nᴜᴘʟᴏᴀᴅᴇᴅ ʙʏ @STxUPLOADER :)"
    SAVED_CUSTOM_THUMB_NAIL = "ᴡᴇ'ᴠᴇ sᴀᴠᴇᴅ ʏᴏᴜʀ ᴄᴜsᴛᴏᴍ ɪᴍᴀɢᴇ ᴛʜᴀᴛ ᴡɪʟʟ ʙᴇ ᴜsᴇᴅ ᴀs ᴛʜᴇ ᴛʜᴜᴍʙɴᴀɪʟ ғᴏʀ ʏᴏᴜʀ ᴠɪᴅᴇᴏ ғɪʟᴇ."
    DEL_ETED_CUSTOM_THUMB_NAIL = "✅ ᴄᴜsᴛᴏᴍ ᴛʜᴜᴍʙɴᴀɪʟ ᴅᴇʟᴇᴛᴇᴅ sᴜᴄᴄᴇssғᴜʟʟʏ."
    CUSTOM_CAPTION_UL_FILE = "{}"
    NO_VOID_FORMAT_FOUND = "ᴀɴ ᴇʀʀᴏʀ ᴏᴄᴄᴜʀʀᴇᴅ ᴀᴄᴄᴏʀᴅɪɴɢ ᴛᴏ ʏᴏᴜᴛᴜʙᴇᴅʟ: {}"
    HELP_USER = """ᴜsɪɴɢ ᴍᴇ: ᴊᴜsᴛ ғᴏʟʟᴏᴡ ᴛʜᴇsᴇ sɪᴍᴘʟᴇ sᴛᴇᴘs!

1. sʜᴀʀᴇ ᴛʜᴇ ᴜʀʟ (ᴇ.ɢ., ᴇxᴀᴍᴘʟᴇ.ᴅᴏᴍᴀɪɴ/ғɪʟᴇ.ᴍᴘ4 | ɴᴇᴡ ғɪʟᴇɴᴀᴍᴇ.ᴍᴘ4).
2. sʜᴀʀᴇ ᴀɴ ɪᴍᴀɢᴇ ғᴏʀ ᴀ ᴄᴜsᴛᴏᴍ ᴛʜᴜᴍʙɴᴀɪʟ (ᴏᴘᴛɪᴏɴᴀʟ).
3. ᴄʜᴏᴏsᴇ ᴀ ʙᴜᴛᴛᴏɴ:
   - sᴠɪᴅᴇᴏ: ᴘʀᴏᴠɪᴅᴇs ᴠɪᴅᴇᴏ ᴡɪᴛʜ sᴄʀᴇᴇɴsʜᴏᴛs
   - ᴅғɪʟᴇ: ᴏғғᴇʀs ғɪʟᴇ (ᴠɪᴅᴇᴏ) ᴡɪᴛʜ sᴄʀᴇᴇɴsʜᴏᴛs
   - ᴠɪᴅᴇᴏ: ᴅᴇʟɪᴠᴇʀs ᴠɪᴅᴇᴏ ᴡɪᴛʜᴏᴜᴛ sᴄʀᴇᴇɴsʜᴏᴛs
   - ғɪʟᴇ: sʜᴀʀᴇs ғɪʟᴇ ᴡɪᴛʜᴏᴜᴛ sᴄʀᴇᴇɴsʜᴏᴛs

ɪғ ᴛʜᴇ ʙᴏᴛ ᴅᴏᴇsɴ'ᴛ ʀᴇsᴘᴏɴᴅ, ʀᴇᴀᴄʜ ᴏᴜᴛ ᴛᴏ @sabbir69x."""
    REPLY_TO_MEDIA_ALBUM_TO_GEN_THUMB = "ᴛᴏ ᴄʀᴇᴀᴛᴇ ᴀ ᴄᴜsᴛᴏᴍ ᴛʜᴜᴍʙɴᴀɪʟ, ʀᴇᴘʟʏ ᴡɪᴛʜ /generatecustomthumbnail ᴛᴏ ᴀ ᴍᴇᴅɪᴀ ᴀʟʙᴜᴍ."
    ERR_ONLY_TWO_MEDIA_IN_ALBUM = """ғᴏʀ ᴛʜᴇ ᴄᴜsᴛᴏᴍ ᴛʜᴜᴍʙɴᴀɪʟ, ᴍᴀᴋᴇ sᴜʀᴇ ʏᴏᴜʀ ᴍᴇᴅɪᴀ ᴀʟʙᴜᴍ ɪɴᴄʟᴜᴅᴇs ᴏɴᴇ ᴏʀ ᴛᴡᴏ ᴘʜᴏᴛᴏs. ᴘʟᴇᴀsᴇ ʀᴇsᴇɴᴅ ᴛʜᴇ ᴀʟʙᴜᴍ ᴡɪᴛʜ ᴛᴡᴏ ᴘʜᴏᴛᴏs ᴏʀ sᴇɴᴅ ᴀ ɴᴇᴡ ᴀʟʙᴜᴍ ᴀɴᴅ ᴛʀʏ ᴀɢᴀɪɴ."
  ᴀғᴛᴇʀ ʏᴏᴜ'ᴠᴇ ʀᴇᴄᴇɪᴠᴇᴅ ᴛʜᴇ ғɪʟᴇ, ғᴇᴇʟ ғʀᴇᴇ ᴛᴏ ᴜsᴇ ᴛʜᴇ /rename ᴄᴏᴍᴍᴀɴᴅ ᴛᴏ ɢɪᴠᴇ ɪᴛ ᴀ ɴᴇᴡ ɴᴀᴍᴇ ᴡɪᴛʜ ᴄᴜsᴛᴏᴍ ᴛʜᴜᴍʙɴᴀɪʟ sᴜᴘᴘᴏʀᴛ.
"""
    CANCEL_STR = "ᴘʀᴏᴄᴇss ᴄᴀɴᴄᴇʟʟᴇᴅ"
    ZIP_UPLOADED_STR = "ᴜᴘʟᴏᴀᴅᴇᴅ {} ғɪʟᴇs ɪɴ {} sᴇᴄᴏɴᴅs"
    SLOW_URL_DECED = "ᴛʜɪs ᴜʀʟ ɪs ʀᴇᴀʟʟʏ sʟᴏᴡ! ʙᴇᴄᴀᴜsᴇ ɪᴛ ᴡᴀs ᴀғғᴇᴄᴛɪɴɢ ᴍʏ ᴘᴇʀғᴏʀᴍᴀɴᴄᴇ ᴡʜɪʟᴇ ʏᴏᴜ ᴡᴇʀᴇ ᴜsɪɴɢ ᴍʏ sᴇʀᴠɪᴄᴇs, ɪ'ᴍ ɴᴏᴛ ʀᴇᴀʟʟʏ ᴜᴘ ғᴏʀ ᴅᴏᴡɴʟᴏᴀᴅɪɴɢ ᴛʜɪs ғɪʟᴇ. ᴄᴀɴ ʏᴏᴜ ғɪɴᴅ ᴀ ғᴀsᴛᴇʀ ᴜʀʟ? ᴛʜᴀᴛ ᴡᴀʏ, ɪ ᴄᴀɴ ᴜᴘʟᴏᴀᴅ ᴛʜᴇ ғɪʟᴇ ᴛᴏ ᴛᴇʟᴇɢʀᴀᴍ ϙᴜɪᴄᴋʟʏ ᴡɪᴛʜᴏᴜᴛ ᴄᴀᴜsɪɴɢ ᴀɴʏ sʟᴏᴡᴅᴏᴡɴs ғᴏʀ ᴏᴛʜᴇʀs."

    ERROR_YTDLP = "ᴛᴏ ʀᴇᴘᴏʀᴛ ᴛʜɪs ɪssᴜᴇ, ᴘʟᴇᴀsᴇ ᴠɪsɪᴛ https://github.com/ytdl-org/youtube-dl/issues. ᴇɴsᴜʀᴇ ᴛʜᴀᴛ ʏᴏᴜ ᴀʀᴇ ᴜsɪɴɢ ᴛʜᴇ ʟᴀᴛᴇsᴛ ᴠᴇʀsɪᴏɴ; ʏᴏᴜ ᴄᴀɴ ғɪɴᴅ ᴜᴘᴅᴀᴛᴇ ɪɴsᴛʀᴜᴄᴛɪᴏɴs ᴀᴛ https://github.com/ytdl-org/youtube-dl#how-do-i-update-youtube-dl. ᴡʜᴇɴ ᴍᴀᴋɪɴɢ ᴛʜᴇ ʀᴇᴘᴏʀᴛ, ʀᴇᴍᴇᴍʙᴇʀ ᴛᴏ ᴜsᴇ ᴛʜᴇ --ᴠᴇʀʙᴏsᴇ ғʟᴀɢ ᴡʜɪʟᴇ ᴄᴀʟʟɪɴɢ ʏᴏᴜᴛᴜʙᴇ-ᴅʟ ᴀɴᴅ ᴘʀᴏᴠɪᴅᴇ ᴛʜᴇ ᴄᴏᴍᴘʟᴇᴛᴇ ᴏᴜᴛᴘᴜᴛ."
